*** src/commands/config.rs:17:8: delete ! in run

*** mutation diff:
--- src/commands/config.rs
+++ delete ! in run
@@ -9,17 +9,17 @@
         Some(p) => p,
         None => Input::with_theme(&ColorfulTheme::default())
             .with_prompt("Path to config file")
             .interact_text()
             .context("Failed to read path")?,
     };
 
     let source_path = dotfiles::expand_tilde(&raw_path)?;
-    if !source_path.exists() {
+    if  /* ~ changed by cargo-mutants ~ */source_path.exists() {
         anyhow::bail!("File not found: {}", source_path.display());
     }
 
     let filename = source_path
         .file_name()
         .ok_or_else(|| anyhow!("Cannot determine filename for {}", source_path.display()))?
         .to_string_lossy()
         .to_string();

*** result: Success
