*** src/commands/init.rs:129:5: replace hint_secret_backends -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/init.rs
+++ replace hint_secret_backends -> Result<()> with Ok(())
@@ -121,65 +121,17 @@
         println!("{} Cloned dotfiles to {}", "✓".green(), dotfiles.display());
     }
 
     Ok(())
 }
 
 fn hint_secret_backends() -> Result<()> {
     // Read which backends are actually used in the secrets file and check their CLIs
-    let secrets = dotfiles::read_secrets().unwrap_or_default();
-    let mut needs_pass = false;
-    let mut needs_op = false;
-    let mut needs_bw = false;
-
-    for uri in secrets.secrets.values() {
-        if uri.starts_with("pass://") {
-            needs_pass = true;
-        } else if uri.starts_with("op://") {
-            needs_op = true;
-        } else if uri.starts_with("bw://") {
-            needs_bw = true;
-        }
-    }
-
-    // If no secrets configured yet, nothing to check
-    if !needs_pass && !needs_op && !needs_bw {
-        println!(
-            "{} No secret backends configured yet — add secrets with {}",
-            "·".dimmed(),
-            "dotf secrets add".cyan()
-        );
-        return Ok(());
-    }
-
-    if needs_pass {
-        #[cfg(target_os = "macos")]
-        check_cli("pass", "Proton Pass", "brew install protonpass/pass/pass")?;
-        #[cfg(not(target_os = "macos"))]
-        check_cli("pass", "Proton Pass", "https://proton.me/pass/download")?;
-    }
-    if needs_op {
-        #[cfg(target_os = "macos")]
-        check_cli("op", "1Password", "brew install 1password-cli")?;
-        #[cfg(not(target_os = "macos"))]
-        check_cli(
-            "op",
-            "1Password",
-            "https://developer.1password.com/docs/cli/get-started/",
-        )?;
-    }
-    if needs_bw {
-        #[cfg(target_os = "macos")]
-        check_cli("bw", "Bitwarden", "brew install bitwarden-cli")?;
-        #[cfg(not(target_os = "macos"))]
-        check_cli("bw", "Bitwarden", "npm install -g @bitwarden/cli")?;
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn check_cli(bin: &str, name: &str, install_hint: &str) -> Result<()> {
     if which(bin).is_ok() {
         println!("{} {} CLI ({}) available", "✓".green(), name, bin);
     } else {
         println!(
             "{} {} CLI (`{}`) not found — install with: {}",

*** result: Success
