*** src/commands/config.rs:55:12: delete ! in run

*** mutation diff:
--- src/commands/config.rs
+++ delete ! in run
@@ -47,17 +47,17 @@
             break;
         }
 
         let secret_value: String = Input::with_theme(&ColorfulTheme::default())
             .with_prompt("Paste the exact secret value to replace")
             .interact_text()
             .context("Failed to read secret value")?;
 
-        if !content.contains(&secret_value) {
+        if  /* ~ changed by cargo-mutants ~ */content.contains(&secret_value) {
             println!("{} Value not found in file, try again", "!".yellow());
             continue;
         }
 
         let placeholder: String = Input::with_theme(&ColorfulTheme::default())
             .with_prompt("Placeholder name (e.g. GITHUB_EMAIL)")
             .interact_text()
             .context("Failed to read placeholder name")?;

*** result: Success
