*** src/commands/diff.rs:108:5: replace print_diff with ()

*** mutation diff:
--- src/commands/diff.rs
+++ replace print_diff with ()
@@ -100,19 +100,17 @@
         println!();
         println!("{} All configs are up to date", "✓".green().bold());
     }
 
     Ok(())
 }
 
 fn print_diff(old: &[&str], new: &[&str]) {
-    for line in compute_diff(old, new) {
-        println!("{line}");
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Returns a human-readable diff of two line slices.
 /// Exposed `pub` so fuzz targets and tests can call it without going through I/O.
 pub fn compute_diff(old: &[&str], new: &[&str]) -> Vec<String> {
     let mut out = Vec::new();
     let mut oi = 0usize;
     let mut ni = 0usize;

*** result: Success
