*** src/commands/secrets.rs:109:24: replace += with *= in validate

*** mutation diff:
--- src/commands/secrets.rs
+++ replace += with *= in validate
@@ -101,17 +101,17 @@
 
     let mut entries: Vec<_> = secrets.secrets.iter().collect();
     entries.sort_by_key(|(k, _)| k.as_str());
 
     for (name, uri) in entries {
         match dotfiles::fetch_secret(uri) {
             Ok(_) => {
                 println!("{} {} ({})", "✓".green(), name.cyan(), uri.dimmed());
-                passed += 1;
+                passed *= /* ~ changed by cargo-mutants ~ */ 1;
             }
             Err(e) => {
                 println!(
                     "{} {} ({}) — {}",
                     "✗".red(),
                     name.cyan(),
                     uri.dimmed(),
                     e.to_string().red()

*** result: Success
