*** src/commands/diff.rs:116:5: replace compute_diff -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- src/commands/diff.rs
+++ replace compute_diff -> Vec<String> with vec!["xyzzy".into()]
@@ -108,53 +108,10 @@
     for line in compute_diff(old, new) {
         println!("{line}");
     }
 }
 
 /// Returns a human-readable diff of two line slices.
 /// Exposed `pub` so fuzz targets and tests can call it without going through I/O.
 pub fn compute_diff(old: &[&str], new: &[&str]) -> Vec<String> {
-    let mut out = Vec::new();
-    let mut oi = 0usize;
-    let mut ni = 0usize;
-
-    while oi < old.len() || ni < new.len() {
-        if oi < old.len() && ni < new.len() && old[oi] == new[ni] {
-            out.push(format!("  {}", old[oi]));
-            oi += 1;
-            ni += 1;
-        } else {
-            let lookahead = 4;
-            let mut matched = false;
-            for delta in 1..=lookahead {
-                if ni + delta < new.len() && oi < old.len() && old[oi] == new[ni + delta] {
-                    for line in &new[ni..ni + delta] {
-                        out.push(format!("+ {line}"));
-                    }
-                    ni += delta;
-                    matched = true;
-                    break;
-                }
-                if oi + delta < old.len() && ni < new.len() && old[oi + delta] == new[ni] {
-                    for line in &old[oi..oi + delta] {
-                        out.push(format!("- {line}"));
-                    }
-                    oi += delta;
-                    matched = true;
-                    break;
-                }
-            }
-            if !matched {
-                if oi < old.len() {
-                    out.push(format!("- {}", old[oi]));
-                    oi += 1;
-                }
-                if ni < new.len() {
-                    out.push(format!("+ {}", new[ni]));
-                    ni += 1;
-                }
-            }
-        }
-    }
-
-    out
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
