*** src/commands/secrets.rs:119:24: replace += with *= in validate

*** mutation diff:
--- src/commands/secrets.rs
+++ replace += with *= in validate
@@ -111,17 +111,17 @@
             Err(e) => {
                 println!(
                     "{} {} ({}) — {}",
                     "✗".red(),
                     name.cyan(),
                     uri.dimmed(),
                     e.to_string().red()
                 );
-                failed += 1;
+                failed *= /* ~ changed by cargo-mutants ~ */ 1;
             }
         }
     }
 
     println!();
     println!(
         "{} passed, {} failed",
         passed.to_string().green(),

*** result: Success
