*** src/commands/secrets.rs:135:15: replace > with == in validate

*** mutation diff:
--- src/commands/secrets.rs
+++ replace > with == in validate
@@ -127,17 +127,17 @@
         passed.to_string().green(),
         if failed > 0 {
             failed.to_string().red()
         } else {
             failed.to_string().green()
         }
     );
 
-    if failed > 0 {
+    if failed == /* ~ changed by cargo-mutants ~ */ 0 {
         anyhow::bail!("{failed} secret(s) failed validation");
     }
 
     Ok(())
 }
 
 fn add(name: String, uri: String) -> Result<()> {
     let mut secrets = dotfiles::read_secrets()?;

*** result: Success
