*** src/commands/secrets.rs:143:5: replace add -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/secrets.rs
+++ replace add -> Result<()> with Ok(())
@@ -135,27 +135,17 @@
     if failed > 0 {
         anyhow::bail!("{failed} secret(s) failed validation");
     }
 
     Ok(())
 }
 
 fn add(name: String, uri: String) -> Result<()> {
-    let mut secrets = dotfiles::read_secrets()?;
-    let existed = secrets.secrets.contains_key(&name);
-    secrets.secrets.insert(name.clone(), uri.clone());
-    dotfiles::write_secrets(&secrets).context("Failed to write .secrets.toml")?;
-
-    if existed {
-        println!("{} Updated {} -> {}", "✓".green(), name.cyan(), uri);
-    } else {
-        println!("{} Added {} -> {}", "✓".green(), name.cyan(), uri);
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn remove(name: String) -> Result<()> {
     let mut secrets = dotfiles::read_secrets()?;
     if secrets.secrets.remove(&name).is_none() {
         anyhow::bail!("Secret '{}' not found in .secrets.toml", name);
     }
     dotfiles::write_secrets(&secrets).context("Failed to write .secrets.toml")?;

*** result: Success
