*** src/commands/secrets.rs:157:5: replace remove -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/secrets.rs
+++ replace remove -> Result<()> with Ok(())
@@ -149,16 +149,10 @@
         println!("{} Updated {} -> {}", "✓".green(), name.cyan(), uri);
     } else {
         println!("{} Added {} -> {}", "✓".green(), name.cyan(), uri);
     }
     Ok(())
 }
 
 fn remove(name: String) -> Result<()> {
-    let mut secrets = dotfiles::read_secrets()?;
-    if secrets.secrets.remove(&name).is_none() {
-        anyhow::bail!("Secret '{}' not found in .secrets.toml", name);
-    }
-    dotfiles::write_secrets(&secrets).context("Failed to write .secrets.toml")?;
-    println!("{} Removed {}", "✓".green(), name.cyan());
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
