*** src/commands/secrets.rs:28:5: replace run -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/secrets.rs
+++ replace run -> Result<()> with Ok(())
@@ -20,22 +20,17 @@
     /// Remove a secret placeholder
     Remove {
         /// Placeholder name to remove
         name: String,
     },
 }
 
 pub fn run(action: SecretsAction) -> Result<()> {
-    match action {
-        SecretsAction::List => list(),
-        SecretsAction::Validate => validate(),
-        SecretsAction::Add { name, uri } => add(name, uri),
-        SecretsAction::Remove { name } => remove(name),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn list() -> Result<()> {
     let secrets = dotfiles::read_secrets()?;
 
     if secrets.secrets.is_empty() {
         println!(
             "No secrets configured. Run {} to add one.",

*** result: Success
