*** src/commands/secrets.rs:37:5: replace list -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/secrets.rs
+++ replace list -> Result<()> with Ok(())
@@ -29,68 +29,17 @@
         SecretsAction::List => list(),
         SecretsAction::Validate => validate(),
         SecretsAction::Add { name, uri } => add(name, uri),
         SecretsAction::Remove { name } => remove(name),
     }
 }
 
 fn list() -> Result<()> {
-    let secrets = dotfiles::read_secrets()?;
-
-    if secrets.secrets.is_empty() {
-        println!(
-            "No secrets configured. Run {} to add one.",
-            "dot secrets add <name> <uri>".cyan()
-        );
-        return Ok(());
-    }
-
-    let name_width = secrets
-        .secrets
-        .keys()
-        .map(|k| k.len())
-        .max()
-        .unwrap_or(12)
-        .max(12);
-    let uri_width = secrets
-        .secrets
-        .values()
-        .map(|v| v.len())
-        .max()
-        .unwrap_or(10)
-        .max(10);
-    let backend_width = "BACKEND".len();
-
-    println!(
-        "{:<name_width$}  {:<uri_width$}  {}",
-        "PLACEHOLDER".bold(),
-        "SECRET URI".bold(),
-        "BACKEND".bold()
-    );
-    println!(
-        "{}",
-        "─"
-            .repeat(name_width + uri_width + backend_width + 4)
-            .dimmed()
-    );
-
-    let mut entries: Vec<_> = secrets.secrets.iter().collect();
-    entries.sort_by_key(|(k, _)| k.as_str());
-
-    for (name, uri) in entries {
-        println!(
-            "{:<name_width$}  {:<uri_width$}  {}",
-            name.cyan(),
-            uri,
-            secret::backend_name(uri).dimmed()
-        );
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate() -> Result<()> {
     let secrets = dotfiles::read_secrets()?;
 
     if secrets.secrets.is_empty() {
         println!("No secrets to validate.");
         return Ok(());

*** result: Success
