*** src/commands/secrets.rs:92:5: replace validate -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/secrets.rs
+++ replace validate -> Result<()> with Ok(())
@@ -84,64 +84,17 @@
             secret::backend_name(uri).dimmed()
         );
     }
 
     Ok(())
 }
 
 fn validate() -> Result<()> {
-    let secrets = dotfiles::read_secrets()?;
-
-    if secrets.secrets.is_empty() {
-        println!("No secrets to validate.");
-        return Ok(());
-    }
-
-    let mut passed = 0usize;
-    let mut failed = 0usize;
-
-    let mut entries: Vec<_> = secrets.secrets.iter().collect();
-    entries.sort_by_key(|(k, _)| k.as_str());
-
-    for (name, uri) in entries {
-        match dotfiles::fetch_secret(uri) {
-            Ok(_) => {
-                println!("{} {} ({})", "✓".green(), name.cyan(), uri.dimmed());
-                passed += 1;
-            }
-            Err(e) => {
-                println!(
-                    "{} {} ({}) — {}",
-                    "✗".red(),
-                    name.cyan(),
-                    uri.dimmed(),
-                    e.to_string().red()
-                );
-                failed += 1;
-            }
-        }
-    }
-
-    println!();
-    println!(
-        "{} passed, {} failed",
-        passed.to_string().green(),
-        if failed > 0 {
-            failed.to_string().red()
-        } else {
-            failed.to_string().green()
-        }
-    );
-
-    if failed > 0 {
-        anyhow::bail!("{failed} secret(s) failed validation");
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn add(name: String, uri: String) -> Result<()> {
     let mut secrets = dotfiles::read_secrets()?;
     let existed = secrets.secrets.contains_key(&name);
     secrets.secrets.insert(name.clone(), uri.clone());
     dotfiles::write_secrets(&secrets).context("Failed to write .secrets.toml")?;

*** result: Success
