*** src/dotfiles.rs:41:5: replace secrets_toml_path -> Result<PathBuf> with Ok(Default::default())

*** mutation diff:
--- src/dotfiles.rs
+++ replace secrets_toml_path -> Result<PathBuf> with Ok(Default::default())
@@ -33,17 +33,17 @@
     } else if path == "~" {
         dirs::home_dir().ok_or_else(|| anyhow!("Cannot determine home directory"))
     } else {
         Ok(PathBuf::from(path))
     }
 }
 
 pub fn secrets_toml_path() -> Result<PathBuf> {
-    Ok(dotfiles_dir()?.join(".secrets.toml"))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn symlinks_toml_path() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join(".symlinks.toml"))
 }
 
 pub fn read_secrets() -> Result<SecretsFile> {
     let path = secrets_toml_path()?;

---- read_write_secrets_roundtrip stdout ----

thread 'read_write_secrets_roundtrip' (42845514) panicked at tests/integration.rs:197:39:
called `Result::unwrap()` on an `Err` value: Failed to write 

Caused by:
    No such file or directory (os error 2)

---- render_and_symlink_all_basic stdout ----

thread 'render_and_symlink_all_basic' (42845516) panicked at tests/integration.rs:95:5:
assertion `left == right` failed
  left: "[user]\n  email = \n  token = "
 right: "[user]\n  email = chris@example.com\n  token = tok123"

---- render_and_symlink_all_multiple_configs stdout ----

thread 'render_and_symlink_all_multiple_configs' (42845519) panicked at tests/integration.rs:157:5:
assertion `left == right` failed
  left: "a = "
 right: "a = valueA"

failures:
    read_write_secrets_roundtrip
    render_and_symlink_all_basic
    render_and_symlink_all_multiple_configs
    render_and_symlink_all_re_render_updates_file

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
