*** src/dotfiles.rs:49:5: replace read_secrets -> Result<SecretsFile> with Ok(Default::default())

*** mutation diff:
--- src/dotfiles.rs
+++ replace read_secrets -> Result<SecretsFile> with Ok(Default::default())
@@ -41,23 +41,17 @@
     Ok(dotfiles_dir()?.join(".secrets.toml"))
 }
 
 pub fn symlinks_toml_path() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join(".symlinks.toml"))
 }
 
 pub fn read_secrets() -> Result<SecretsFile> {
-    let path = secrets_toml_path()?;
-    if !path.exists() {
-        return Ok(SecretsFile::default());
-    }
-    let content =
-        fs::read_to_string(&path).with_context(|| format!("Failed to read {}", path.display()))?;
-    toml::from_str(&content).with_context(|| "Failed to parse .secrets.toml")
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn write_secrets(secrets: &SecretsFile) -> Result<()> {
     let path = secrets_toml_path()?;
     let content =
         toml::to_string_pretty(secrets).with_context(|| "Failed to serialize .secrets.toml")?;
     fs::write(&path, content).with_context(|| format!("Failed to write {}", path.display()))
 }

---- read_write_secrets_roundtrip stdout ----

thread 'read_write_secrets_roundtrip' (42851419) panicked at tests/integration.rs:200:30:
no entry found for key

---- render_and_symlink_all_basic stdout ----

thread 'render_and_symlink_all_basic' (42851421) panicked at tests/integration.rs:95:5:
assertion `left == right` failed
  left: "[user]\n  email = \n  token = "
 right: "[user]\n  email = chris@example.com\n  token = tok123"

---- render_and_symlink_all_multiple_configs stdout ----

thread 'render_and_symlink_all_multiple_configs' (42851424) panicked at tests/integration.rs:157:5:
assertion `left == right` failed
  left: "a = "
 right: "a = valueA"

failures:
    read_write_secrets_roundtrip
    render_and_symlink_all_basic
    render_and_symlink_all_multiple_configs
    render_and_symlink_all_re_render_updates_file

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
