*** src/dotfiles.rs:50:8: delete ! in read_secrets

*** mutation diff:
--- src/dotfiles.rs
+++ delete ! in read_secrets
@@ -42,17 +42,17 @@
 }
 
 pub fn symlinks_toml_path() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join(".symlinks.toml"))
 }
 
 pub fn read_secrets() -> Result<SecretsFile> {
     let path = secrets_toml_path()?;
-    if !path.exists() {
+    if  /* ~ changed by cargo-mutants ~ */path.exists() {
         return Ok(SecretsFile::default());
     }
     let content =
         fs::read_to_string(&path).with_context(|| format!("Failed to read {}", path.display()))?;
     toml::from_str(&content).with_context(|| "Failed to parse .secrets.toml")
 }
 
 pub fn write_secrets(secrets: &SecretsFile) -> Result<()> {

---- read_write_secrets_roundtrip stdout ----

thread 'read_write_secrets_roundtrip' (42851445) panicked at tests/integration.rs:200:30:
no entry found for key

---- read_secrets_returns_default_when_missing stdout ----

thread 'read_secrets_returns_default_when_missing' (42851443) panicked at tests/integration.rs:224:44:
called `Result::unwrap()` on an `Err` value: Failed to read /var/folders/8x/kz3rzv6x24l1pq1p4vjs5v100000gn/T/.tmp5VQejq/dotfiles/.secrets.toml

Caused by:
    No such file or directory (os error 2)

---- render_and_symlink_all_basic stdout ----

thread 'render_and_symlink_all_basic' (42851447) panicked at tests/integration.rs:95:5:
assertion `left == right` failed
  left: "[user]\n  email = \n  token = "
 right: "[user]\n  email = chris@example.com\n  token = tok123"

failures:
    read_secrets_returns_default_when_missing
    read_write_secrets_roundtrip
    render_and_symlink_all_basic
    render_and_symlink_all_multiple_configs
    render_and_symlink_all_re_render_updates_file

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
