*** src/dotfiles.rs:59:5: replace write_secrets -> Result<()> with Ok(())

*** mutation diff:
--- src/dotfiles.rs
+++ replace write_secrets -> Result<()> with Ok(())
@@ -51,20 +51,17 @@
         return Ok(SecretsFile::default());
     }
     let content =
         fs::read_to_string(&path).with_context(|| format!("Failed to read {}", path.display()))?;
     toml::from_str(&content).with_context(|| "Failed to parse .secrets.toml")
 }
 
 pub fn write_secrets(secrets: &SecretsFile) -> Result<()> {
-    let path = secrets_toml_path()?;
-    let content =
-        toml::to_string_pretty(secrets).with_context(|| "Failed to serialize .secrets.toml")?;
-    fs::write(&path, content).with_context(|| format!("Failed to write {}", path.display()))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn read_symlinks() -> Result<SymlinksFile> {
     let path = symlinks_toml_path()?;
     if !path.exists() {
         return Ok(SymlinksFile::default());
     }
     let content =

---- read_write_secrets_roundtrip stdout ----

thread 'read_write_secrets_roundtrip' (42852525) panicked at tests/integration.rs:200:30:
no entry found for key

failures:
    read_write_secrets_roundtrip

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
