*** src/dotfiles.rs:83:5: replace fetch_secret -> Result<String> with Ok(String::new())

*** mutation diff:
--- src/dotfiles.rs
+++ replace fetch_secret -> Result<String> with Ok(String::new())
@@ -75,17 +75,17 @@
 pub fn write_symlinks(symlinks: &SymlinksFile) -> Result<()> {
     let path = symlinks_toml_path()?;
     let content =
         toml::to_string_pretty(symlinks).with_context(|| "Failed to serialize .symlinks.toml")?;
     fs::write(&path, content).with_context(|| format!("Failed to write {}", path.display()))
 }
 
 pub fn fetch_secret(uri: &str) -> Result<String> {
-    secret::fetch(uri)
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_template(template_path: &Path, secrets: &SecretsFile) -> Result<String> {
     let template_content = fs::read_to_string(template_path)
         .with_context(|| format!("Failed to read template {}", template_path.display()))?;
 
     let mut hbs = Handlebars::new();
     hbs.set_strict_mode(false);

---- dotfiles::tests::render_template_substitutes_env_placeholders stdout ----

thread 'dotfiles::tests::render_template_substitutes_env_placeholders' (42854230) panicked at src/dotfiles.rs:271:9:
assertion `left == right` failed
  left: "email = \ntoken = "
 right: "email = chris@example.com\ntoken = abc123"

---- dotfiles::tests::render_template_multiline_value stdout ----

thread 'dotfiles::tests::render_template_multiline_value' (42854228) panicked at src/dotfiles.rs:312:9:
assertion `left == right` failed
  left: "key = "
 right: "key = line1\nline2"

---- dotfiles::tests::render_and_write_creates_output_file stdout ----

thread 'dotfiles::tests::render_and_write_creates_output_file' (42854227) panicked at src/dotfiles.rs:390:9:
assertion `left == right` failed
  left: "host = "
 right: "host = myhost"

failures:
    dotfiles::tests::render_and_write_creates_output_file
    dotfiles::tests::render_template_multiline_value
    dotfiles::tests::render_template_substitutes_env_placeholders

test result: FAILED. 23 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
