*** src/secret.rs:114:5: replace fetch_env -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- src/secret.rs
+++ replace fetch_env -> Result<String> with Ok("xyzzy".into())
@@ -106,17 +106,17 @@
     }
 
     let value = String::from_utf8(output.stdout)
         .map_err(|_| anyhow!("Bitwarden output for {original_uri} is not valid UTF-8"))?;
     Ok(value.trim().to_string())
 }
 
 fn fetch_env(var: &str) -> Result<String> {
-    std::env::var(var).map_err(|_| anyhow!("Environment variable '{}' is not set", var))
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     // ── backend_name ─────────────────────────────────────────────
     #[test]

---- secret::tests::fetch_env_missing_errors stdout ----

thread 'secret::tests::fetch_env_missing_errors' (42875225) panicked at src/secret.rs:169:57:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

---- secret::tests::fetch_env_empty_var_name_errors stdout ----

thread 'secret::tests::fetch_env_empty_var_name_errors' (42875224) panicked at src/secret.rs:175:35:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

---- secret::tests::fetch_env_present stdout ----

thread 'secret::tests::fetch_env_present' (42875226) panicked at src/secret.rs:162:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "hunter2"

failures:
    dotfiles::tests::render_and_write_creates_output_file
    dotfiles::tests::render_template_multiline_value
    dotfiles::tests::render_template_substitutes_env_placeholders
    secret::tests::fetch_env_empty_var_name_errors
    secret::tests::fetch_env_missing_errors
    secret::tests::fetch_env_present

test result: FAILED. 20 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
