*** src/commands/diff.rs:124:16: replace += with -= in compute_diff

*** mutation diff:
--- src/commands/diff.rs
+++ replace += with -= in compute_diff
@@ -116,17 +116,17 @@
     let mut out = Vec::new();
     let mut oi = 0usize;
     let mut ni = 0usize;
 
     while oi < old.len() || ni < new.len() {
         if oi < old.len() && ni < new.len() && old[oi] == new[ni] {
             out.push(format!("  {}", old[oi]));
             oi += 1;
-            ni += 1;
+            ni -= /* ~ changed by cargo-mutants ~ */ 1;
         } else {
             let lookahead = 4;
             let mut matched = false;
             for delta in 1..=lookahead {
                 if ni + delta < new.len() && oi < old.len() && old[oi] == new[ni + delta] {
                     for line in &new[ni..ni + delta] {
                         out.push(format!("+ {line}"));
                     }

*** result: Success
