*** src/secret.rs:12:5: replace fetch -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- src/secret.rs
+++ replace fetch -> Result<String> with Ok("xyzzy".into())
@@ -4,30 +4,17 @@
 /// Fetch a secret value from any supported backend based on URI scheme.
 ///
 /// Supported schemes:
 ///   pass://vault/item/field   — Proton Pass CLI (`pass`)
 ///   op://vault/item/field     — 1Password CLI (`op`)
 ///   bw://item-name/field      — Bitwarden CLI (`bw`, requires BW_SESSION env var)
 ///   env://VAR_NAME            — environment variable (useful for CI)
 pub fn fetch(uri: &str) -> Result<String> {
-    if let Some(path) = uri.strip_prefix("pass://") {
-        fetch_pass(path, uri)
-    } else if let Some(path) = uri.strip_prefix("op://") {
-        fetch_op(path, uri)
-    } else if let Some(path) = uri.strip_prefix("bw://") {
-        fetch_bw(path, uri)
-    } else if let Some(var) = uri.strip_prefix("env://") {
-        fetch_env(var)
-    } else {
-        Err(anyhow!(
-            "Unknown secret URI scheme: '{}'\n  Supported: pass://, op://, bw://, env://",
-            uri
-        ))
-    }
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Return a human-readable backend name for a URI.
 pub fn backend_name(uri: &str) -> &'static str {
     if uri.starts_with("pass://") {
         "Proton Pass"
     } else if uri.starts_with("op://") {
         "1Password"

---- secret::tests::fetch_bw_routes_to_bitwarden stdout ----

thread 'secret::tests::fetch_bw_routes_to_bitwarden' (42863857) panicked at src/secret.rs:169:49:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

---- secret::tests::fetch_bw_no_field_routes_to_bitwarden stdout ----

thread 'secret::tests::fetch_bw_no_field_routes_to_bitwarden' (42863856) panicked at src/secret.rs:179:40:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

---- secret::tests::fetch_empty_uri_errors stdout ----

thread 'secret::tests::fetch_empty_uri_errors' (42863858) panicked at src/secret.rs:133:29:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

failures:
    dotfiles::tests::render_and_write_creates_output_file
    dotfiles::tests::render_template_multiline_value
    dotfiles::tests::render_template_substitutes_env_placeholders
    secret::tests::fetch_bw_no_field_routes_to_bitwarden
    secret::tests::fetch_bw_routes_to_bitwarden
    secret::tests::fetch_empty_uri_errors
    secret::tests::fetch_env_empty_var_name_errors
    secret::tests::fetch_env_missing_errors
    secret::tests::fetch_env_present
    secret::tests::fetch_no_double_slash_errors
    secret::tests::fetch_op_routes_to_1password
    secret::tests::fetch_pass_routes_to_proton_pass

test result: FAILED. 13 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
