*** src/secret.rs:30:5: replace backend_name -> &'static str with ""

*** mutation diff:
--- src/secret.rs
+++ replace backend_name -> &'static str with ""
@@ -22,27 +22,17 @@
             "Unknown secret URI scheme: '{}'\n  Supported: pass://, op://, bw://, env://",
             uri
         ))
     }
 }
 
 /// Return a human-readable backend name for a URI.
 pub fn backend_name(uri: &str) -> &'static str {
-    if uri.starts_with("pass://") {
-        "Proton Pass"
-    } else if uri.starts_with("op://") {
-        "1Password"
-    } else if uri.starts_with("bw://") {
-        "Bitwarden"
-    } else if uri.starts_with("env://") {
-        "environment"
-    } else {
-        "unknown"
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 // pass item get pass://vault/item --fields password
 fn fetch_pass(path: &str, original_uri: &str) -> Result<String> {
     let full_uri = format!("pass://{path}");
     let output = Command::new("pass")
         .args(["item", "get", &full_uri, "--fields", "password"])
         .output()

---- secret::tests::backend_name_unknown_returns_unknown stdout ----

thread 'secret::tests::backend_name_unknown_returns_unknown' (42864645) panicked at src/secret.rs:122:9:
assertion `left == right` failed
  left: ""
 right: "unknown"

---- secret::tests::backend_name_known_schemes stdout ----

thread 'secret::tests::backend_name_known_schemes' (42864644) panicked at src/secret.rs:114:9:
assertion `left == right` failed
  left: ""
 right: "Proton Pass"

failures:
    secret::tests::backend_name_known_schemes
    secret::tests::backend_name_unknown_returns_unknown

test result: FAILED. 24 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
