*** src/commands/diff.rs:129:23: replace + with - in compute_diff

*** mutation diff:
--- src/commands/diff.rs
+++ replace + with - in compute_diff
@@ -121,17 +121,17 @@
         if oi < old.len() && ni < new.len() && old[oi] == new[ni] {
             out.push(format!("  {}", old[oi]));
             oi += 1;
             ni += 1;
         } else {
             let lookahead = 4;
             let mut matched = false;
             for delta in 1..=lookahead {
-                if ni + delta < new.len() && oi < old.len() && old[oi] == new[ni + delta] {
+                if ni - /* ~ changed by cargo-mutants ~ */ delta < new.len() && oi < old.len() && old[oi] == new[ni + delta] {
                     for line in &new[ni..ni + delta] {
                         out.push(format!("+ {line}"));
                     }
                     ni += delta;
                     matched = true;
                     break;
                 }
                 if oi + delta < old.len() && ni < new.len() && old[oi + delta] == new[ni] {

*** result: Success
