*** src/secret.rs:45:5: replace fetch_pass -> Result<String> with Ok(String::new())

*** mutation diff:
--- src/secret.rs
+++ replace fetch_pass -> Result<String> with Ok(String::new())
@@ -37,30 +37,17 @@
         "environment"
     } else {
         "unknown"
     }
 }
 
 // pass item get pass://vault/item --fields password
 fn fetch_pass(path: &str, original_uri: &str) -> Result<String> {
-    let full_uri = format!("pass://{path}");
-    let output = Command::new("pass")
-        .args(["item", "get", &full_uri, "--fields", "password"])
-        .output()
-        .map_err(|e| anyhow!("Failed to run Proton Pass CLI (`pass`): {e}\n  Install: brew install protonpass/pass/pass"))?;
-
-    if !output.status.success() {
-        let stderr = String::from_utf8_lossy(&output.stderr);
-        return Err(anyhow!("Proton Pass failed for {original_uri}: {stderr}"));
-    }
-
-    let value = String::from_utf8(output.stdout)
-        .map_err(|_| anyhow!("Proton Pass output for {original_uri} is not valid UTF-8"))?;
-    Ok(value.trim().to_string())
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 // op read op://vault/item/field
 fn fetch_op(path: &str, original_uri: &str) -> Result<String> {
     let full_uri = format!("op://{path}");
     let output = Command::new("op")
         .args(["read", &full_uri])
         .output()

---- secret::tests::fetch_pass_routes_to_proton_pass stdout ----

thread 'secret::tests::fetch_pass_routes_to_proton_pass' (42866224) panicked at src/secret.rs:190:52:
called `Result::unwrap_err()` on an `Ok` value: ""

failures:
    secret::tests::fetch_pass_routes_to_proton_pass

test result: FAILED. 25 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
