*** src/secret.rs:63:5: replace fetch_op -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- src/secret.rs
+++ replace fetch_op -> Result<String> with Ok("xyzzy".into())
@@ -55,34 +55,17 @@
 
     let value = String::from_utf8(output.stdout)
         .map_err(|_| anyhow!("Proton Pass output for {original_uri} is not valid UTF-8"))?;
     Ok(value.trim().to_string())
 }
 
 // op read op://vault/item/field
 fn fetch_op(path: &str, original_uri: &str) -> Result<String> {
-    let full_uri = format!("op://{path}");
-    let output = Command::new("op")
-        .args(["read", &full_uri])
-        .output()
-        .map_err(|e| {
-            anyhow!(
-                "Failed to run 1Password CLI (`op`): {e}\n  Install: brew install 1password-cli"
-            )
-        })?;
-
-    if !output.status.success() {
-        let stderr = String::from_utf8_lossy(&output.stderr);
-        return Err(anyhow!("1Password failed for {original_uri}: {stderr}"));
-    }
-
-    let value = String::from_utf8(output.stdout)
-        .map_err(|_| anyhow!("1Password output for {original_uri} is not valid UTF-8"))?;
-    Ok(value.trim().to_string())
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 // bw get password <item-name>  (field after last / if present, else "password")
 fn fetch_bw(path: &str, original_uri: &str) -> Result<String> {
     // bw://item-name/field or bw://item-name
     let (item, field) = match path.rsplit_once('/') {
         Some((item, field)) => (item, field),
         None => (path, "password"),

---- secret::tests::fetch_op_routes_to_1password stdout ----

thread 'secret::tests::fetch_op_routes_to_1password' (42868784) panicked at src/secret.rs:197:50:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

failures:
    secret::tests::fetch_op_routes_to_1password

test result: FAILED. 25 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
