*** src/secret.rs:86:5: replace fetch_bw -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- src/secret.rs
+++ replace fetch_bw -> Result<String> with Ok("xyzzy".into())
@@ -78,41 +78,17 @@
     let value = String::from_utf8(output.stdout)
         .map_err(|_| anyhow!("1Password output for {original_uri} is not valid UTF-8"))?;
     Ok(value.trim().to_string())
 }
 
 // bw get password <item-name>  (field after last / if present, else "password")
 fn fetch_bw(path: &str, original_uri: &str) -> Result<String> {
     // bw://item-name/field or bw://item-name
-    let (item, field) = match path.rsplit_once('/') {
-        Some((item, field)) => (item, field),
-        None => (path, "password"),
-    };
-
-    let subcommand = match field {
-        "username" => "username",
-        "notes" => "notes",
-        "uri" => "uri",
-        _ => "password",
-    };
-
-    let output = Command::new("bw")
-        .args(["get", subcommand, item])
-        .output()
-        .map_err(|e| anyhow!("Failed to run Bitwarden CLI (`bw`): {e}\n  Install: brew install bitwarden-cli\n  Requires BW_SESSION env var (run: export BW_SESSION=$(bw unlock --raw))"))?;
-
-    if !output.status.success() {
-        let stderr = String::from_utf8_lossy(&output.stderr);
-        return Err(anyhow!("Bitwarden failed for {original_uri}: {stderr}"));
-    }
-
-    let value = String::from_utf8(output.stdout)
-        .map_err(|_| anyhow!("Bitwarden output for {original_uri} is not valid UTF-8"))?;
-    Ok(value.trim().to_string())
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn fetch_env(var: &str) -> Result<String> {
     std::env::var(var).map_err(|_| anyhow!("Environment variable '{}' is not set", var))
 }
 
 #[cfg(test)]
 mod tests {

---- secret::tests::fetch_bw_routes_to_bitwarden stdout ----

thread 'secret::tests::fetch_bw_routes_to_bitwarden' (42871103) panicked at src/secret.rs:158:49:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

---- secret::tests::fetch_bw_no_field_routes_to_bitwarden stdout ----

thread 'secret::tests::fetch_bw_no_field_routes_to_bitwarden' (42871102) panicked at src/secret.rs:168:40:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

failures:
    secret::tests::fetch_bw_no_field_routes_to_bitwarden
    secret::tests::fetch_bw_routes_to_bitwarden

test result: FAILED. 24 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
