*** src/secret.rs:92:9: delete match arm "username" in fetch_bw

*** mutation diff:
--- src/secret.rs
+++ delete match arm "username" in fetch_bw
@@ -84,17 +84,17 @@
 fn fetch_bw(path: &str, original_uri: &str) -> Result<String> {
     // bw://item-name/field or bw://item-name
     let (item, field) = match path.rsplit_once('/') {
         Some((item, field)) => (item, field),
         None => (path, "password"),
     };
 
     let subcommand = match field {
-        "username" => "username",
+         /* ~ changed by cargo-mutants ~ */
         "notes" => "notes",
         "uri" => "uri",
         _ => "password",
     };
 
     let output = Command::new("bw")
         .args(["get", subcommand, item])
         .output()

*** result: Success
