*** src/secret.rs:93:9: delete match arm "notes" in fetch_bw

*** mutation diff:
--- src/secret.rs
+++ delete match arm "notes" in fetch_bw
@@ -85,17 +85,17 @@
     // bw://item-name/field or bw://item-name
     let (item, field) = match path.rsplit_once('/') {
         Some((item, field)) => (item, field),
         None => (path, "password"),
     };
 
     let subcommand = match field {
         "username" => "username",
-        "notes" => "notes",
+         /* ~ changed by cargo-mutants ~ */
         "uri" => "uri",
         _ => "password",
     };
 
     let output = Command::new("bw")
         .args(["get", subcommand, item])
         .output()
         .map_err(|e| anyhow!("Failed to run Bitwarden CLI (`bw`): {e}\n  Install: brew install bitwarden-cli\n  Requires BW_SESSION env var (run: export BW_SESSION=$(bw unlock --raw))"))?;

*** result: Success
