*** src/secret.rs:94:9: delete match arm "uri" in fetch_bw

*** mutation diff:
--- src/secret.rs
+++ delete match arm "uri" in fetch_bw
@@ -86,17 +86,17 @@
     let (item, field) = match path.rsplit_once('/') {
         Some((item, field)) => (item, field),
         None => (path, "password"),
     };
 
     let subcommand = match field {
         "username" => "username",
         "notes" => "notes",
-        "uri" => "uri",
+         /* ~ changed by cargo-mutants ~ */
         _ => "password",
     };
 
     let output = Command::new("bw")
         .args(["get", subcommand, item])
         .output()
         .map_err(|e| anyhow!("Failed to run Bitwarden CLI (`bw`): {e}\n  Install: brew install bitwarden-cli\n  Requires BW_SESSION env var (run: export BW_SESSION=$(bw unlock --raw))"))?;

*** result: Success
