*** src/commands/diff.rs:133:24: replace += with -= in compute_diff

*** mutation diff:
--- src/commands/diff.rs
+++ replace += with -= in compute_diff
@@ -125,17 +125,17 @@
         } else {
             let lookahead = 4;
             let mut matched = false;
             for delta in 1..=lookahead {
                 if ni + delta < new.len() && oi < old.len() && old[oi] == new[ni + delta] {
                     for line in &new[ni..ni + delta] {
                         out.push(format!("+ {line}"));
                     }
-                    ni += delta;
+                    ni -= /* ~ changed by cargo-mutants ~ */ delta;
                     matched = true;
                     break;
                 }
                 if oi + delta < old.len() && ni < new.len() && old[oi + delta] == new[ni] {
                     for line in &old[oi..oi + delta] {
                         out.push(format!("- {line}"));
                     }
                     oi += delta;

*** result: Success
