*** src/commands/diff.rs:138:45: replace + with - in compute_diff

*** mutation diff:
--- src/commands/diff.rs
+++ replace + with - in compute_diff
@@ -130,17 +130,17 @@
                     for line in &new[ni..ni + delta] {
                         out.push(format!("+ {line}"));
                     }
                     ni += delta;
                     matched = true;
                     break;
                 }
                 if oi + delta < old.len() && ni < new.len() && old[oi + delta] == new[ni] {
-                    for line in &old[oi..oi + delta] {
+                    for line in &old[oi..oi - /* ~ changed by cargo-mutants ~ */ delta] {
                         out.push(format!("- {line}"));
                     }
                     oi += delta;
                     matched = true;
                     break;
                 }
             }
             if !matched {

*** result: Success
