*** src/commands/diff.rs:146:16: delete ! in compute_diff

*** mutation diff:
--- src/commands/diff.rs
+++ delete ! in compute_diff
@@ -138,17 +138,17 @@
                     for line in &old[oi..oi + delta] {
                         out.push(format!("- {line}"));
                     }
                     oi += delta;
                     matched = true;
                     break;
                 }
             }
-            if !matched {
+            if  /* ~ changed by cargo-mutants ~ */matched {
                 if oi < old.len() {
                     out.push(format!("- {}", old[oi]));
                     oi += 1;
                 }
                 if ni < new.len() {
                     out.push(format!("+ {}", new[ni]));
                     ni += 1;
                 }

*** result: Success
