*** src/commands/diff.rs:149:24: replace += with *= in compute_diff

*** mutation diff:
--- src/commands/diff.rs
+++ replace += with *= in compute_diff
@@ -141,17 +141,17 @@
                     oi += delta;
                     matched = true;
                     break;
                 }
             }
             if !matched {
                 if oi < old.len() {
                     out.push(format!("- {}", old[oi]));
-                    oi += 1;
+                    oi *= /* ~ changed by cargo-mutants ~ */ 1;
                 }
                 if ni < new.len() {
                     out.push(format!("+ {}", new[ni]));
                     ni += 1;
                 }
             }
         }
     }

*** result: Success
