*** src/commands/diff.rs:153:24: replace += with -= in compute_diff

*** mutation diff:
--- src/commands/diff.rs
+++ replace += with -= in compute_diff
@@ -145,16 +145,16 @@
             }
             if !matched {
                 if oi < old.len() {
                     out.push(format!("- {}", old[oi]));
                     oi += 1;
                 }
                 if ni < new.len() {
                     out.push(format!("+ {}", new[ni]));
-                    ni += 1;
+                    ni -= /* ~ changed by cargo-mutants ~ */ 1;
                 }
             }
         }
     }
 
     out
 }

*** result: Success
