*** src/commands/diff.rs:17:16: delete ! in run

*** mutation diff:
--- src/commands/diff.rs
+++ delete ! in run
@@ -9,17 +9,17 @@
     let symlinks = dotfiles::read_symlinks()?;
 
     if symlinks.symlinks.is_empty() {
         anyhow::bail!("No managed configs found.");
     }
 
     let names_to_diff: Vec<String> = match name {
         Some(n) => {
-            if !symlinks.symlinks.contains_key(&n) {
+            if  /* ~ changed by cargo-mutants ~ */symlinks.symlinks.contains_key(&n) {
                 anyhow::bail!("Config '{}' is not managed by dotf", n);
             }
             vec![n]
         }
         None => {
             let mut names: Vec<String> = symlinks.symlinks.keys().cloned().collect();
             names.sort();
             names.insert(0, "(all)".to_string());

*** result: Success
