*** src/commands/diff.rs:79:18: replace == with != in run

*** mutation diff:
--- src/commands/diff.rs
+++ replace == with != in run
@@ -71,17 +71,17 @@
 
         let current = if rendered_path.exists() {
             fs::read_to_string(&rendered_path)
                 .with_context(|| format!("Failed to read {}", rendered_path.display()))?
         } else {
             String::new()
         };
 
-        if fresh == current {
+        if fresh != /* ~ changed by cargo-mutants ~ */ current {
             println!("{} {} — no changes", "✓".green(), config_name.cyan());
         } else {
             any_diff = true;
             println!();
             println!(
                 "{} {}",
                 "━━".cyan(),
                 format!(" diff: {} ", config_name).cyan().bold()

*** result: Success
