*** src/commands/diff.rs:99:8: delete ! in run

*** mutation diff:
--- src/commands/diff.rs
+++ delete ! in run
@@ -91,17 +91,17 @@
             let old_lines: Vec<&str> = current.lines().collect();
             let new_lines: Vec<&str> = fresh.lines().collect();
 
             print_diff(&old_lines, &new_lines);
             println!();
         }
     }
 
-    if !any_diff && names_to_diff.len() > 1 {
+    if  /* ~ changed by cargo-mutants ~ */any_diff && names_to_diff.len() > 1 {
         println!();
         println!("{} All configs are up to date", "✓".green().bold());
     }
 
     Ok(())
 }
 
 fn print_diff(old: &[&str], new: &[&str]) {

*** result: Success
