*** src/commands/init.rs:11:5: replace run -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/init.rs
+++ replace run -> Result<()> with Ok(())
@@ -3,46 +3,17 @@
 use dialoguer::{Input, theme::ColorfulTheme};
 use std::fs;
 use std::process::Command;
 use which::which;
 
 use crate::dotfiles;
 
 pub fn run() -> Result<()> {
-    println!("{}", "┌─────────────────────────────────────┐".cyan());
-    println!("{}", "│        dotf — dotfiles manager       │".cyan());
-    println!("{}", "│    secret injection via pass/op/bw   │".cyan());
-    println!("{}", "└─────────────────────────────────────┘".cyan());
-    println!();
-
-    setup_dotfiles_dir()?;
-    hint_secret_backends()?;
-    #[cfg(target_os = "macos")]
-    run_brewfile()?;
-    #[cfg(unix)]
-    install_completions()?;
-
-    let synced = dotfiles::render_and_symlink_all()?;
-
-    println!();
-    println!("{}", "Setup complete!".green().bold());
-    if synced.is_empty() {
-        println!(
-            "  No configs symlinked yet. Run {} to add one.",
-            "dot config <path>".cyan()
-        );
-    } else {
-        println!("  Symlinked configs:");
-        for entry in &synced {
-            println!("    {} {}", "✓".green(), entry);
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn setup_dotfiles_dir() -> Result<()> {
     let dotfiles = dotfiles::dotfiles_dir()?;
 
     if dotfiles.exists() {
         println!("{} {} already exists", "✓".green(), dotfiles.display());
         return Ok(());

*** result: Success
