*** src/commands/init.rs:181:5: replace check_cli -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/init.rs
+++ replace check_cli -> Result<()> with Ok(())
@@ -173,28 +173,17 @@
         #[cfg(not(target_os = "macos"))]
         check_cli("bw", "Bitwarden", "npm install -g @bitwarden/cli")?;
     }
 
     Ok(())
 }
 
 fn check_cli(bin: &str, name: &str, install_hint: &str) -> Result<()> {
-    if which(bin).is_ok() {
-        println!("{} {} CLI ({}) available", "✓".green(), name, bin);
-    } else {
-        println!(
-            "{} {} CLI (`{}`) not found — install with: {}",
-            "!".yellow(),
-            name,
-            bin,
-            install_hint.cyan()
-        );
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 fn run_brewfile() -> Result<()> {
     let brewfile = dotfiles::dotfiles_dir()?.join("Brewfile");
     if !brewfile.exists() {
         println!("{} No Brewfile found, skipping brew bundle", "·".dimmed());
         return Ok(());

*** result: Success
