*** src/commands/init.rs:197:5: replace run_brewfile -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/init.rs
+++ replace run_brewfile -> Result<()> with Ok(())
@@ -189,36 +189,17 @@
             install_hint.cyan()
         );
     }
     Ok(())
 }
 
 #[cfg(target_os = "macos")]
 fn run_brewfile() -> Result<()> {
-    let brewfile = dotfiles::dotfiles_dir()?.join("Brewfile");
-    if !brewfile.exists() {
-        println!("{} No Brewfile found, skipping brew bundle", "·".dimmed());
-        return Ok(());
-    }
-
-    println!("Running brew bundle...");
-    let status = Command::new("brew")
-        .args([
-            "bundle",
-            "install",
-            &format!("--file={}", brewfile.display()),
-        ])
-        .status()
-        .context("Failed to run brew bundle")?;
-    if !status.success() {
-        anyhow::bail!("brew bundle install failed");
-    }
-    println!("{} brew bundle complete", "✓".green());
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(unix)]
 fn install_completions() -> Result<()> {
     let home = dirs::home_dir().context("Could not determine home directory")?;
     let completions_dir = home.join(".zfunc");
     fs::create_dir_all(&completions_dir).context("Failed to create ~/.zfunc")?;

*** result: Success
