*** src/commands/init.rs:212:8: delete ! in run_brewfile

*** mutation diff:
--- src/commands/init.rs
+++ delete ! in run_brewfile
@@ -204,17 +204,17 @@
     let status = Command::new("brew")
         .args([
             "bundle",
             "install",
             &format!("--file={}", brewfile.display()),
         ])
         .status()
         .context("Failed to run brew bundle")?;
-    if !status.success() {
+    if  /* ~ changed by cargo-mutants ~ */status.success() {
         anyhow::bail!("brew bundle install failed");
     }
     println!("{} brew bundle complete", "✓".green());
     Ok(())
 }
 
 #[cfg(unix)]
 fn install_completions() -> Result<()> {

*** result: Success
