*** src/commands/init.rs:221:5: replace install_completions -> Result<()> with Ok(())

*** mutation diff:
--- src/commands/init.rs
+++ replace install_completions -> Result<()> with Ok(())
@@ -213,37 +213,10 @@
         anyhow::bail!("brew bundle install failed");
     }
     println!("{} brew bundle complete", "✓".green());
     Ok(())
 }
 
 #[cfg(unix)]
 fn install_completions() -> Result<()> {
-    let home = dirs::home_dir().context("Could not determine home directory")?;
-    let completions_dir = home.join(".zfunc");
-    fs::create_dir_all(&completions_dir).context("Failed to create ~/.zfunc")?;
-
-    let completion_file = completions_dir.join("_dotf");
-    let output = Command::new("dotf").args(["completions", "zsh"]).output();
-
-    match output {
-        Ok(out) if out.status.success() => {
-            fs::write(&completion_file, out.stdout)
-                .context("Failed to write zsh completion file")?;
-            println!(
-                "{} Zsh completions installed to {}",
-                "✓".green(),
-                completion_file.display()
-            );
-            println!(
-                "  Add to ~/.zshrc if not already present: fpath=(~/.zfunc $fpath) && autoload -U compinit && compinit"
-            );
-        }
-        _ => {
-            println!(
-                "{} Could not install completions (dotf not in PATH yet — run after brew install)",
-                "·".dimmed()
-            );
-        }
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
