*** src/commands/init.rs:229:20: replace match guard out.status.success() with true in install_completions

*** mutation diff:
--- src/commands/init.rs
+++ replace match guard out.status.success() with true in install_completions
@@ -221,17 +221,17 @@
     let home = dirs::home_dir().context("Could not determine home directory")?;
     let completions_dir = home.join(".zfunc");
     fs::create_dir_all(&completions_dir).context("Failed to create ~/.zfunc")?;
 
     let completion_file = completions_dir.join("_dotf");
     let output = Command::new("dotf").args(["completions", "zsh"]).output();
 
     match output {
-        Ok(out) if out.status.success() => {
+        Ok(out) if true /* ~ changed by cargo-mutants ~ */ => {
             fs::write(&completion_file, out.stdout)
                 .context("Failed to write zsh completion file")?;
             println!(
                 "{} Zsh completions installed to {}",
                 "✓".green(),
                 completion_file.display()
             );
             println!(

*** result: Success
