*** src/commands/remove.rs:73:8: delete ! in run

*** mutation diff:
--- src/commands/remove.rs
+++ delete ! in run
@@ -65,17 +65,17 @@
     };
 
     let confirmed = Confirm::with_theme(&ColorfulTheme::default())
         .with_prompt(format!("Remove '{}' from dotf management?", config_name))
         .default(false)
         .interact()
         .context("Failed to read confirmation")?;
 
-    if !confirmed {
+    if  /* ~ changed by cargo-mutants ~ */confirmed {
         println!("{} Aborted", "·".dimmed());
         return Ok(());
     }
 
     // Remove symlink
     if link_path.symlink_metadata().is_ok() {
         fs::remove_file(&link_path)
             .with_context(|| format!("Failed to remove symlink {}", link_path.display()))?;

*** result: Success
