*** src/commands/remove.rs:86:16: replace && with || in run

*** mutation diff:
--- src/commands/remove.rs
+++ replace && with || in run
@@ -78,17 +78,17 @@
     // Remove symlink
     if link_path.symlink_metadata().is_ok() {
         fs::remove_file(&link_path)
             .with_context(|| format!("Failed to remove symlink {}", link_path.display()))?;
         println!("{} Removed symlink {}", "✓".green(), link_path.display());
     }
 
     // Optionally restore the rendered file in place of the symlink
-    if restore && rendered_path.exists() {
+    if restore || /* ~ changed by cargo-mutants ~ */ rendered_path.exists() {
         fs::copy(&rendered_path, &link_path)
             .with_context(|| format!("Failed to restore file to {}", link_path.display()))?;
         println!("{} Restored file to {}", "✓".green(), link_path.display());
     }
 
     // Remove template
     if template_path.exists() {
         fs::remove_file(&template_path)

*** result: Success
