*** src/commands/sync.rs:23:8: delete ! in run

*** mutation diff:
--- src/commands/sync.rs
+++ delete ! in run
@@ -15,17 +15,17 @@
         .context("Failed to run git pull")?;
 
     let pull_stdout = String::from_utf8_lossy(&pull_output.stdout);
     let pull_stderr = String::from_utf8_lossy(&pull_output.stderr);
 
     if !pull_stdout.trim().is_empty() {
         println!("{}", pull_stdout.trim());
     }
-    if !pull_stderr.trim().is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */pull_stderr.trim().is_empty() {
         println!("{}", pull_stderr.trim().dimmed());
     }
 
     if !pull_output.status.success() {
         // Check for merge/rebase conflicts
         let conflict_check = Command::new("git")
             .args(["diff", "--name-only", "--diff-filter=U"])
             .current_dir(&dotfiles_dir)

*** result: Success
