*** src/commands/sync.rs:27:8: delete ! in run

*** mutation diff:
--- src/commands/sync.rs
+++ delete ! in run
@@ -19,17 +19,17 @@
 
     if !pull_stdout.trim().is_empty() {
         println!("{}", pull_stdout.trim());
     }
     if !pull_stderr.trim().is_empty() {
         println!("{}", pull_stderr.trim().dimmed());
     }
 
-    if !pull_output.status.success() {
+    if  /* ~ changed by cargo-mutants ~ */pull_output.status.success() {
         // Check for merge/rebase conflicts
         let conflict_check = Command::new("git")
             .args(["diff", "--name-only", "--diff-filter=U"])
             .current_dir(&dotfiles_dir)
             .output();
 
         let has_conflicts = conflict_check
             .map(|o| !o.stdout.is_empty())

*** result: Success
