*** src/commands/sync.rs:35:22: delete ! in run

*** mutation diff:
--- src/commands/sync.rs
+++ delete ! in run
@@ -27,17 +27,17 @@
     if !pull_output.status.success() {
         // Check for merge/rebase conflicts
         let conflict_check = Command::new("git")
             .args(["diff", "--name-only", "--diff-filter=U"])
             .current_dir(&dotfiles_dir)
             .output();
 
         let has_conflicts = conflict_check
-            .map(|o| !o.stdout.is_empty())
+            .map(|o|  /* ~ changed by cargo-mutants ~ */o.stdout.is_empty())
             .unwrap_or(false);
 
         if has_conflicts {
             let conflict_files = Command::new("git")
                 .args(["diff", "--name-only", "--diff-filter=U"])
                 .current_dir(&dotfiles_dir)
                 .output()
                 .map(|o| String::from_utf8_lossy(&o.stdout).trim().to_string())

*** result: Success
