*** src/commands/sync.rs:77:8: delete ! in run

*** mutation diff:
--- src/commands/sync.rs
+++ delete ! in run
@@ -69,17 +69,17 @@
     let now = chrono::Local::now().format("%Y-%m-%d").to_string();
     let commit_msg = format!("sync: {now}");
 
     let add_output = Command::new("git")
         .args(["add", "-A"])
         .current_dir(&dotfiles_dir)
         .output()
         .context("Failed to run git add")?;
-    if !add_output.status.success() {
+    if  /* ~ changed by cargo-mutants ~ */add_output.status.success() {
         anyhow::bail!("git add failed");
     }
 
     let commit_output = Command::new("git")
         .args(["commit", "-m", &commit_msg])
         .current_dir(&dotfiles_dir)
         .output()
         .context("Failed to run git commit")?;

*** result: Success
