*** src/commands/sync.rs:88:52: replace || with && in run

*** mutation diff:
--- src/commands/sync.rs
+++ replace || with && in run
@@ -80,17 +80,17 @@
 
     let commit_output = Command::new("git")
         .args(["commit", "-m", &commit_msg])
         .current_dir(&dotfiles_dir)
         .output()
         .context("Failed to run git commit")?;
 
     let commit_stdout = String::from_utf8_lossy(&commit_output.stdout);
-    if commit_stdout.contains("nothing to commit") || !commit_output.status.success() {
+    if commit_stdout.contains("nothing to commit") && /* ~ changed by cargo-mutants ~ */ !commit_output.status.success() {
         println!("{} Nothing new to commit", "·".dimmed());
     } else {
         println!("{} Committed: {}", "✓".green(), commit_msg);
 
         let push_output = Command::new("git")
             .args(["push"])
             .current_dir(&dotfiles_dir)
             .output()

*** result: Success
