*** src/commands/sync.rs:98:12: delete ! in run

*** mutation diff:
--- src/commands/sync.rs
+++ delete ! in run
@@ -90,17 +90,17 @@
     } else {
         println!("{} Committed: {}", "✓".green(), commit_msg);
 
         let push_output = Command::new("git")
             .args(["push"])
             .current_dir(&dotfiles_dir)
             .output()
             .context("Failed to run git push")?;
-        if !push_output.status.success() {
+        if  /* ~ changed by cargo-mutants ~ */push_output.status.success() {
             let stderr = String::from_utf8_lossy(&push_output.stderr);
             anyhow::bail!("git push failed: {stderr}");
         }
         println!("{} Pushed to remote", "✓".green());
     }
 
     println!();
     println!(

*** result: Success
