*** src/dotfiles.rs:118:5: replace render_and_write -> Result<()> with Ok(())

*** mutation diff:
--- src/dotfiles.rs
+++ replace render_and_write -> Result<()> with Ok(())
@@ -110,23 +110,17 @@
     Ok(rendered)
 }
 
 pub fn render_and_write(
     template_path: &Path,
     output_path: &Path,
     secrets: &SecretsFile,
 ) -> Result<()> {
-    let rendered = render_template(template_path, secrets)?;
-    if let Some(parent) = output_path.parent() {
-        fs::create_dir_all(parent)
-            .with_context(|| format!("Failed to create dir {}", parent.display()))?;
-    }
-    fs::write(output_path, rendered)
-        .with_context(|| format!("Failed to write rendered file {}", output_path.display()))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn ensure_symlink(target: &Path, link: &Path) -> Result<()> {
     if link.exists() || link.symlink_metadata().is_ok() {
         let existing = fs::read_link(link).unwrap_or_default();
         if existing == target {
             return Ok(());
         }

---- dotfiles::tests::render_and_write_creates_output_file stdout ----

thread 'dotfiles::tests::render_and_write_creates_output_file' (42857444) panicked at src/dotfiles.rs:384:45:
called `Result::unwrap()` on an `Err` value: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    dotfiles::tests::render_and_write_creates_output_file

test result: FAILED. 25 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
