*** src/dotfiles.rs:128:22: replace || with && in ensure_symlink

*** mutation diff:
--- src/dotfiles.rs
+++ replace || with && in ensure_symlink
@@ -120,17 +120,17 @@
         fs::create_dir_all(parent)
             .with_context(|| format!("Failed to create dir {}", parent.display()))?;
     }
     fs::write(output_path, rendered)
         .with_context(|| format!("Failed to write rendered file {}", output_path.display()))
 }
 
 pub fn ensure_symlink(target: &Path, link: &Path) -> Result<()> {
-    if link.exists() || link.symlink_metadata().is_ok() {
+    if link.exists() && /* ~ changed by cargo-mutants ~ */ link.symlink_metadata().is_ok() {
         let existing = fs::read_link(link).unwrap_or_default();
         if existing == target {
             return Ok(());
         }
         fs::remove_file(link).with_context(|| {
             format!(
                 "Failed to remove existing file/symlink at {}",
                 link.display()

*** result: Success
