*** src/dotfiles.rs:128:5: replace ensure_symlink -> Result<()> with Ok(())

*** mutation diff:
--- src/dotfiles.rs
+++ replace ensure_symlink -> Result<()> with Ok(())
@@ -120,54 +120,17 @@
         fs::create_dir_all(parent)
             .with_context(|| format!("Failed to create dir {}", parent.display()))?;
     }
     fs::write(output_path, rendered)
         .with_context(|| format!("Failed to write rendered file {}", output_path.display()))
 }
 
 pub fn ensure_symlink(target: &Path, link: &Path) -> Result<()> {
-    if link.exists() || link.symlink_metadata().is_ok() {
-        let existing = fs::read_link(link).unwrap_or_default();
-        if existing == target {
-            return Ok(());
-        }
-        fs::remove_file(link).with_context(|| {
-            format!(
-                "Failed to remove existing file/symlink at {}",
-                link.display()
-            )
-        })?;
-    }
-    if let Some(parent) = link.parent() {
-        fs::create_dir_all(parent)
-            .with_context(|| format!("Failed to create parent dir {}", parent.display()))?;
-    }
-    #[cfg(unix)]
-    {
-        use std::os::unix::fs as unix_fs;
-        unix_fs::symlink(target, link).with_context(|| {
-            format!(
-                "Failed to create symlink {} -> {}",
-                link.display(),
-                target.display()
-            )
-        })
-    }
-    #[cfg(windows)]
-    {
-        use std::os::windows::fs as win_fs;
-        win_fs::symlink_file(target, link).with_context(|| {
-            format!(
-                "Failed to create symlink {} -> {}",
-                link.display(),
-                target.display()
-            )
-        })
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Exposed for testing only — splits bw URI into (item, subcommand).
 #[cfg(test)]
 pub fn _bw_parse(path: &str) -> (&str, &str) {
     match path.rsplit_once('/') {
         Some((item, field)) => {
             let sub = match field {

---- dotfiles::tests::ensure_symlink_creates_link stdout ----

thread 'dotfiles::tests::ensure_symlink_creates_link' (42858382) panicked at src/dotfiles.rs:290:9:
assertion failed: link.symlink_metadata().is_ok()

---- dotfiles::tests::ensure_symlink_creates_parent_dirs stdout ----

thread 'dotfiles::tests::ensure_symlink_creates_parent_dirs' (42858383) panicked at src/dotfiles.rs:335:9:
assertion failed: link.symlink_metadata().is_ok()

---- dotfiles::tests::ensure_symlink_noop_if_already_correct stdout ----

thread 'dotfiles::tests::ensure_symlink_noop_if_already_correct' (42858384) panicked at src/dotfiles.rs:305:41:
called `Result::unwrap()` on an `Err` value: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    dotfiles::tests::ensure_symlink_creates_link
    dotfiles::tests::ensure_symlink_creates_parent_dirs
    dotfiles::tests::ensure_symlink_noop_if_already_correct
    dotfiles::tests::ensure_symlink_replaces_stale_link

test result: FAILED. 22 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
