*** src/dotfiles.rs:130:21: replace == with != in ensure_symlink

*** mutation diff:
--- src/dotfiles.rs
+++ replace == with != in ensure_symlink
@@ -122,17 +122,17 @@
     }
     fs::write(output_path, rendered)
         .with_context(|| format!("Failed to write rendered file {}", output_path.display()))
 }
 
 pub fn ensure_symlink(target: &Path, link: &Path) -> Result<()> {
     if link.exists() || link.symlink_metadata().is_ok() {
         let existing = fs::read_link(link).unwrap_or_default();
-        if existing == target {
+        if existing != /* ~ changed by cargo-mutants ~ */ target {
             return Ok(());
         }
         fs::remove_file(link).with_context(|| {
             format!(
                 "Failed to remove existing file/symlink at {}",
                 link.display()
             )
         })?;

---- dotfiles::tests::ensure_symlink_replaces_stale_link stdout ----

thread 'dotfiles::tests::ensure_symlink_replaces_stale_link' (42859876) panicked at src/dotfiles.rs:360:9:
assertion `left == right` failed
  left: "/var/folders/8x/kz3rzv6x24l1pq1p4vjs5v100000gn/T/.tmpjV1fXB/old.conf"
 right: "/var/folders/8x/kz3rzv6x24l1pq1p4vjs5v100000gn/T/.tmpjV1fXB/new.conf"

failures:
    dotfiles::tests::ensure_symlink_replaces_stale_link

test result: FAILED. 25 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
