*** src/dotfiles.rs:186:5: replace render_and_symlink_all -> Result<Vec<String>> with Ok(vec![String::new()])

*** mutation diff:
--- src/dotfiles.rs
+++ replace render_and_symlink_all -> Result<Vec<String>> with Ok(vec![String::new()])
@@ -178,41 +178,17 @@
             };
             (item, sub)
         }
         None => (path, "password"),
     }
 }
 
 pub fn render_and_symlink_all() -> Result<Vec<String>> {
-    let secrets = read_secrets()?;
-    let symlinks = read_symlinks()?;
-    let configs = configs_dir()?;
-    let mut done = Vec::new();
-
-    for (name, target_str) in &symlinks.symlinks {
-        let template_path = configs.join(format!("{name}.tmpl"));
-        let output_path = configs.join(name);
-        let link_path = expand_tilde(target_str)?;
-
-        if !template_path.exists() {
-            eprintln!("Warning: template not found for {name}, skipping");
-            continue;
-        }
-
-        render_and_write(&template_path, &output_path, &secrets)
-            .with_context(|| format!("Failed to render {name}"))?;
-
-        ensure_symlink(&output_path, &link_path)
-            .with_context(|| format!("Failed to symlink {name}"))?;
-
-        done.push(format!("{name} -> {target_str}"));
-    }
-
-    Ok(done)
+    Ok(vec![String::new()]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::collections::HashMap;
     use tempfile::TempDir;

---- render_and_symlink_all_basic stdout ----

thread 'render_and_symlink_all_basic' (42861705) panicked at tests/integration.rs:69:53:
called `Result::unwrap()` on an `Err` value: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- render_and_symlink_all_empty_secrets_toml stdout ----

thread 'render_and_symlink_all_empty_secrets_toml' (42861706) panicked at tests/integration.rs:69:53:
called `Result::unwrap()` on an `Err` value: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- render_and_symlink_all_missing_template_is_skipped stdout ----

thread 'render_and_symlink_all_missing_template_is_skipped' (42861707) panicked at tests/integration.rs:119:5:
assertion failed: done.is_empty()

failures:
    render_and_symlink_all_basic
    render_and_symlink_all_empty_secrets_toml
    render_and_symlink_all_missing_template_is_skipped
    render_and_symlink_all_multiple_configs
    render_and_symlink_all_re_render_updates_file

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
