*** src/dotfiles.rs:26:5: replace configs_dir -> Result<PathBuf> with Ok(Default::default())

*** mutation diff:
--- src/dotfiles.rs
+++ replace configs_dir -> Result<PathBuf> with Ok(Default::default())
@@ -18,17 +18,17 @@
 }
 
 pub fn dotfiles_dir() -> Result<PathBuf> {
     let home = dirs::home_dir().ok_or_else(|| anyhow!("Cannot determine home directory"))?;
     Ok(home.join("dotfiles"))
 }
 
 pub fn configs_dir() -> Result<PathBuf> {
-    Ok(dotfiles_dir()?.join("configs"))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn expand_tilde(path: &str) -> Result<PathBuf> {
     if let Some(rest) = path.strip_prefix("~/") {
         let home = dirs::home_dir().ok_or_else(|| anyhow!("Cannot determine home directory"))?;
         Ok(home.join(rest))
     } else if path == "~" {
         dirs::home_dir().ok_or_else(|| anyhow!("Cannot determine home directory"))

---- render_and_symlink_all_basic stdout ----
Warning: template not found for .gitconfig, skipping

thread 'render_and_symlink_all_basic' (42850656) panicked at tests/integration.rs:94:5:
assertion `left == right` failed
  left: 0
 right: 1

---- render_and_symlink_all_empty_secrets_toml stdout ----
Warning: template not found for .zshrc, skipping

thread 'render_and_symlink_all_empty_secrets_toml' (42850657) panicked at tests/integration.rs:132:5:
assertion `left == right` failed
  left: 0
 right: 1

---- render_and_symlink_all_multiple_configs stdout ----
Warning: template not found for b.conf, skipping
Warning: template not found for a.conf, skipping

thread 'render_and_symlink_all_multiple_configs' (42850659) panicked at tests/integration.rs:155:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    render_and_symlink_all_basic
    render_and_symlink_all_empty_secrets_toml
    render_and_symlink_all_multiple_configs
    render_and_symlink_all_re_render_updates_file

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
