*** src/dotfiles.rs:30:5: replace expand_tilde -> Result<PathBuf> with Ok(Default::default())

*** mutation diff:
--- src/dotfiles.rs
+++ replace expand_tilde -> Result<PathBuf> with Ok(Default::default())
@@ -22,24 +22,17 @@
     Ok(home.join("dotfiles"))
 }
 
 pub fn configs_dir() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join("configs"))
 }
 
 pub fn expand_tilde(path: &str) -> Result<PathBuf> {
-    if let Some(rest) = path.strip_prefix("~/") {
-        let home = dirs::home_dir().ok_or_else(|| anyhow!("Cannot determine home directory"))?;
-        Ok(home.join(rest))
-    } else if path == "~" {
-        dirs::home_dir().ok_or_else(|| anyhow!("Cannot determine home directory"))
-    } else {
-        Ok(PathBuf::from(path))
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn secrets_toml_path() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join(".secrets.toml"))
 }
 
 pub fn symlinks_toml_path() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join(".symlinks.toml"))

---- dotfiles::tests::expand_tilde_tilde_slash stdout ----

thread 'dotfiles::tests::expand_tilde_tilde_slash' (42847946) panicked at src/dotfiles.rs:228:9:
assertion `left == right` failed
  left: ""
 right: "/Users/chrisfentiman/.gitconfig"

---- dotfiles::tests::expand_tilde_tilde_only stdout ----

thread 'dotfiles::tests::expand_tilde_tilde_only' (42847945) panicked at src/dotfiles.rs:222:9:
assertion `left == right` failed
  left: ""
 right: "/Users/chrisfentiman"

---- dotfiles::tests::expand_tilde_nested_path stdout ----

thread 'dotfiles::tests::expand_tilde_nested_path' (42847942) panicked at src/dotfiles.rs:234:9:
assertion `left == right` failed
  left: ""
 right: "/Users/chrisfentiman/.config/mise/config.toml"

failures:
    dotfiles::tests::expand_tilde_nested_path
    dotfiles::tests::expand_tilde_no_tilde
    dotfiles::tests::expand_tilde_plain_path
    dotfiles::tests::expand_tilde_tilde_only
    dotfiles::tests::expand_tilde_tilde_slash

test result: FAILED. 21 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
