*** src/dotfiles.rs:33:20: replace == with != in expand_tilde

*** mutation diff:
--- src/dotfiles.rs
+++ replace == with != in expand_tilde
@@ -25,17 +25,17 @@
 pub fn configs_dir() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join("configs"))
 }
 
 pub fn expand_tilde(path: &str) -> Result<PathBuf> {
     if let Some(rest) = path.strip_prefix("~/") {
         let home = dirs::home_dir().ok_or_else(|| anyhow!("Cannot determine home directory"))?;
         Ok(home.join(rest))
-    } else if path == "~" {
+    } else if path != /* ~ changed by cargo-mutants ~ */ "~" {
         dirs::home_dir().ok_or_else(|| anyhow!("Cannot determine home directory"))
     } else {
         Ok(PathBuf::from(path))
     }
 }
 
 pub fn secrets_toml_path() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join(".secrets.toml"))

---- dotfiles::tests::expand_tilde_no_tilde stdout ----

thread 'dotfiles::tests::expand_tilde_no_tilde' (42841681) panicked at src/dotfiles.rs:250:9:
assertion `left == right` failed
  left: "/Users/chrisfentiman"
 right: "relative/path"

---- dotfiles::tests::expand_tilde_plain_path stdout ----

thread 'dotfiles::tests::expand_tilde_plain_path' (42841682) panicked at src/dotfiles.rs:223:9:
assertion `left == right` failed
  left: "/Users/chrisfentiman"
 right: "/etc/hosts"

---- dotfiles::tests::expand_tilde_tilde_only stdout ----

thread 'dotfiles::tests::expand_tilde_tilde_only' (42841683) panicked at src/dotfiles.rs:229:9:
assertion `left == right` failed
  left: "~"
 right: "/Users/chrisfentiman"

failures:
    dotfiles::tests::expand_tilde_no_tilde
    dotfiles::tests::expand_tilde_plain_path
    dotfiles::tests::expand_tilde_tilde_only

test result: FAILED. 23 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
