*** src/dotfiles.rs:45:5: replace symlinks_toml_path -> Result<PathBuf> with Ok(Default::default())

*** mutation diff:
--- src/dotfiles.rs
+++ replace symlinks_toml_path -> Result<PathBuf> with Ok(Default::default())
@@ -37,17 +37,17 @@
     }
 }
 
 pub fn secrets_toml_path() -> Result<PathBuf> {
     Ok(dotfiles_dir()?.join(".secrets.toml"))
 }
 
 pub fn symlinks_toml_path() -> Result<PathBuf> {
-    Ok(dotfiles_dir()?.join(".symlinks.toml"))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn read_secrets() -> Result<SecretsFile> {
     let path = secrets_toml_path()?;
     if !path.exists() {
         return Ok(SecretsFile::default());
     }
     let content =

---- render_and_symlink_all_empty_secrets_toml stdout ----

thread 'render_and_symlink_all_empty_secrets_toml' (42847638) panicked at tests/integration.rs:132:5:
assertion `left == right` failed
  left: 0
 right: 1

---- render_and_symlink_all_basic stdout ----

thread 'render_and_symlink_all_basic' (42847637) panicked at tests/integration.rs:94:5:
assertion `left == right` failed
  left: 0
 right: 1

---- read_write_symlinks_roundtrip stdout ----

thread 'read_write_symlinks_roundtrip' (42847636) panicked at tests/integration.rs:213:40:
called `Result::unwrap()` on an `Err` value: Failed to write 

Caused by:
    No such file or directory (os error 2)

failures:
    read_write_symlinks_roundtrip
    render_and_symlink_all_basic
    render_and_symlink_all_empty_secrets_toml
    render_and_symlink_all_multiple_configs
    render_and_symlink_all_re_render_updates_file

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
