*** src/dotfiles.rs:66:5: replace read_symlinks -> Result<SymlinksFile> with Ok(Default::default())

*** mutation diff:
--- src/dotfiles.rs
+++ replace read_symlinks -> Result<SymlinksFile> with Ok(Default::default())
@@ -58,23 +58,17 @@
 pub fn write_secrets(secrets: &SecretsFile) -> Result<()> {
     let path = secrets_toml_path()?;
     let content =
         toml::to_string_pretty(secrets).with_context(|| "Failed to serialize .secrets.toml")?;
     fs::write(&path, content).with_context(|| format!("Failed to write {}", path.display()))
 }
 
 pub fn read_symlinks() -> Result<SymlinksFile> {
-    let path = symlinks_toml_path()?;
-    if !path.exists() {
-        return Ok(SymlinksFile::default());
-    }
-    let content =
-        fs::read_to_string(&path).with_context(|| format!("Failed to read {}", path.display()))?;
-    toml::from_str(&content).with_context(|| "Failed to parse .symlinks.toml")
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn write_symlinks(symlinks: &SymlinksFile) -> Result<()> {
     let path = symlinks_toml_path()?;
     let content =
         toml::to_string_pretty(symlinks).with_context(|| "Failed to serialize .symlinks.toml")?;
     fs::write(&path, content).with_context(|| format!("Failed to write {}", path.display()))
 }

---- read_write_symlinks_roundtrip stdout ----

thread 'read_write_symlinks_roundtrip' (42853491) panicked at tests/integration.rs:216:31:
no entry found for key

---- render_and_symlink_all_basic stdout ----

thread 'render_and_symlink_all_basic' (42853492) panicked at tests/integration.rs:94:5:
assertion `left == right` failed
  left: 0
 right: 1

---- render_and_symlink_all_empty_secrets_toml stdout ----

thread 'render_and_symlink_all_empty_secrets_toml' (42853493) panicked at tests/integration.rs:132:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    read_write_symlinks_roundtrip
    render_and_symlink_all_basic
    render_and_symlink_all_empty_secrets_toml
    render_and_symlink_all_multiple_configs
    render_and_symlink_all_re_render_updates_file

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
