*** src/dotfiles.rs:67:8: delete ! in read_symlinks

*** mutation diff:
--- src/dotfiles.rs
+++ delete ! in read_symlinks
@@ -59,17 +59,17 @@
     let path = secrets_toml_path()?;
     let content =
         toml::to_string_pretty(secrets).with_context(|| "Failed to serialize .secrets.toml")?;
     fs::write(&path, content).with_context(|| format!("Failed to write {}", path.display()))
 }
 
 pub fn read_symlinks() -> Result<SymlinksFile> {
     let path = symlinks_toml_path()?;
-    if !path.exists() {
+    if  /* ~ changed by cargo-mutants ~ */path.exists() {
         return Ok(SymlinksFile::default());
     }
     let content =
         fs::read_to_string(&path).with_context(|| format!("Failed to read {}", path.display()))?;
     toml::from_str(&content).with_context(|| "Failed to parse .symlinks.toml")
 }
 
 pub fn write_symlinks(symlinks: &SymlinksFile) -> Result<()> {

---- read_symlinks_returns_default_when_missing stdout ----

thread 'read_symlinks_returns_default_when_missing' (42854682) panicked at tests/integration.rs:232:45:
called `Result::unwrap()` on an `Err` value: Failed to read /var/folders/8x/kz3rzv6x24l1pq1p4vjs5v100000gn/T/.tmpnz9A4X/dotfiles/.symlinks.toml

Caused by:
    No such file or directory (os error 2)

---- read_write_symlinks_roundtrip stdout ----

thread 'read_write_symlinks_roundtrip' (42854684) panicked at tests/integration.rs:216:31:
no entry found for key

---- render_and_symlink_all_basic stdout ----

thread 'render_and_symlink_all_basic' (42854685) panicked at tests/integration.rs:94:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    read_symlinks_returns_default_when_missing
    read_write_symlinks_roundtrip
    render_and_symlink_all_basic
    render_and_symlink_all_empty_secrets_toml
    render_and_symlink_all_multiple_configs
    render_and_symlink_all_re_render_updates_file

test result: FAILED. 3 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
