*** src/dotfiles.rs:76:5: replace write_symlinks -> Result<()> with Ok(())

*** mutation diff:
--- src/dotfiles.rs
+++ replace write_symlinks -> Result<()> with Ok(())
@@ -68,20 +68,17 @@
         return Ok(SymlinksFile::default());
     }
     let content =
         fs::read_to_string(&path).with_context(|| format!("Failed to read {}", path.display()))?;
     toml::from_str(&content).with_context(|| "Failed to parse .symlinks.toml")
 }
 
 pub fn write_symlinks(symlinks: &SymlinksFile) -> Result<()> {
-    let path = symlinks_toml_path()?;
-    let content =
-        toml::to_string_pretty(symlinks).with_context(|| "Failed to serialize .symlinks.toml")?;
-    fs::write(&path, content).with_context(|| format!("Failed to write {}", path.display()))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn fetch_secret(uri: &str) -> Result<String> {
     secret::fetch(uri)
 }
 
 pub fn render_template(template_path: &Path, secrets: &SecretsFile) -> Result<String> {
     let template_content = fs::read_to_string(template_path)

---- read_write_symlinks_roundtrip stdout ----

thread 'read_write_symlinks_roundtrip' (42855369) panicked at tests/integration.rs:216:31:
no entry found for key

failures:
    read_write_symlinks_roundtrip

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
