*** src/dotfiles.rs:87:5: replace render_template -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- src/dotfiles.rs
+++ replace render_template -> Result<String> with Ok("xyzzy".into())
@@ -79,40 +79,17 @@
     fs::write(&path, content).with_context(|| format!("Failed to write {}", path.display()))
 }
 
 pub fn fetch_secret(uri: &str) -> Result<String> {
     secret::fetch(uri)
 }
 
 pub fn render_template(template_path: &Path, secrets: &SecretsFile) -> Result<String> {
-    let template_content = fs::read_to_string(template_path)
-        .with_context(|| format!("Failed to read template {}", template_path.display()))?;
-
-    let mut hbs = Handlebars::new();
-    hbs.set_strict_mode(false);
-    hbs.register_template_string("t", &template_content)
-        .with_context(|| format!("Failed to parse template {}", template_path.display()))?;
-
-    let mut values: HashMap<String, String> = HashMap::new();
-    for (name, uri) in &secrets.secrets {
-        match fetch_secret(uri) {
-            Ok(val) => {
-                values.insert(name.clone(), val);
-            }
-            Err(e) => {
-                eprintln!("Warning: could not fetch secret {name} ({uri}): {e}");
-            }
-        }
-    }
-
-    let rendered = hbs
-        .render("t", &values)
-        .with_context(|| format!("Failed to render template {}", template_path.display()))?;
-    Ok(rendered)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_and_write(
     template_path: &Path,
     output_path: &Path,
     secrets: &SecretsFile,
 ) -> Result<()> {
     let rendered = render_template(template_path, secrets)?;

---- dotfiles::tests::render_template_multiline_value stdout ----

thread 'dotfiles::tests::render_template_multiline_value' (42856916) panicked at src/dotfiles.rs:289:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "key = line1\nline2"

---- dotfiles::tests::render_template_substitutes_env_placeholders stdout ----

thread 'dotfiles::tests::render_template_substitutes_env_placeholders' (42856918) panicked at src/dotfiles.rs:248:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "email = chris@example.com\ntoken = abc123"

---- dotfiles::tests::render_template_no_placeholders_is_identity stdout ----

thread 'dotfiles::tests::render_template_no_placeholders_is_identity' (42856917) panicked at src/dotfiles.rs:274:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "[core]\n  editor = nvim\n  autocrlf = input\n"

failures:
    dotfiles::tests::render_and_write_creates_output_file
    dotfiles::tests::render_template_multiline_value
    dotfiles::tests::render_template_no_placeholders_is_identity
    dotfiles::tests::render_template_substitutes_env_placeholders
    dotfiles::tests::render_template_unknown_placeholder_renders_empty

test result: FAILED. 21 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
