*** src/main.rs:56:5: replace main -> Result<()> with Ok(())

*** mutation diff:
--- src/main.rs
+++ replace main -> Result<()> with Ok(())
@@ -48,25 +48,10 @@
     Completions {
         /// Shell to generate completions for
         #[arg(value_enum)]
         shell: Shell,
     },
 }
 
 fn main() -> Result<()> {
-    let cli = Cli::parse();
-
-    match cli.command {
-        Command::Init => commands::init::run(),
-        Command::Config { path } => commands::config::run(path),
-        Command::Modify { name } => commands::modify::run(name),
-        Command::Diff { name } => commands::diff::run(name),
-        Command::Remove { name } => commands::remove::run(name),
-        Command::Sync => commands::sync::run(),
-        Command::Secrets { action } => commands::secrets::run(action),
-        Command::Status => commands::status::run(),
-        Command::Completions { shell } => {
-            generate(shell, &mut Cli::command(), "dotf", &mut std::io::stdout());
-            Ok(())
-        }
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
